jorgebucaran/fisher
PatrickF1/fzf.fish
decors/fish-colored-man
IlanCosman/tide@main
kidonng/zoxide.fish
jorgebucaran/autopair.fish
nickeb96/puffer-fish
lewisacidic/fish-git-abbr
realiserad/fish-ai
vitallium/tokyonight-fish
