jorgebucaran/fisher
kidonng/zoxide.fish
mgoodness/fzf.fish
decors/fish-colored-man
mgoodness/tide
jorgebucaran/autopair.fish
nickeb96/puffer-fish
lewisacidic/fish-git-abbr
branchv/tide-show-on-cmd
halostatue/fish-chezmoi
roderik/flock
