jorgebucaran/fisher
kidonng/zoxide.fish
mgoodness/fzf.fish
patrickf1/colored_man_pages.fish
mgoodness/tide
jorgebucaran/autopair.fish
nickeb96/puffer-fish
lewisacidic/fish-git-abbr
branchv/tide-show-on-cmd
halostatue/fish-chezmoi
tbcrawford/opah.fish
