tap "beeftornado/rmtree"
tap "hashicorp/tap"

brew "argocd"
brew "bash"
brew "bat"
brew "chezmoi"
brew "cocoapods"
brew "colima"
brew "coreutils"
brew "curl"
brew "delve"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "dockutil"
brew "eza"
brew "fd"
brew "fish", args: ["HEAD"]
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "git"
brew "git-delta"
brew "glances"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "goreleaser"
brew "grep"
brew "helm"
brew "httpie"
brew "jfrog-cli"
brew "jq"
brew "krew"
brew "ksops"
brew "kubernetes-cli"
brew "kustomize"
brew "less"
brew "mas"
brew "parallel"
brew "pdm"
brew "pipx"
brew "poetry"
brew "pre-commit"
brew "python"
brew "qemu"
brew "ripgrep"
brew "sd"
brew "skaffold"
brew "sops"
brew "tfenv", args: ["HEAD"]
brew "trash"
brew "uv"
brew "vault"
brew "viddy"
brew "virtualenv"
brew "wget"
brew "yq"
brew "zoxide"

cask "1password"
cask "1password-cli"
cask "akuity"
cask "betterdisplay"
cask "caffeine"
cask "claude-code"
cask "copilot-cli"
cask "discord"
cask "flutter"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "rectangle"
cask "slack"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "AdBlock", id: 1402042596
mas "Apple Developer", id: 640199958
mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Okta Verify", id: 490179405
mas "Pages", id: 409201541
mas "Submersion", id: 6757456915
#mas "WhatsApp Messenger", id: 310633997
mas "Xcode", id: 497799835
